In [2]:
import pandas as pd
  
# Get the data
column_names = ['user_id', 'item_id', 'rating', 'timestamp']
  
path = 'file.tsv'
  
df = pd.read_csv(path, sep='\t', names=column_names)
  
# Check the head of the data
df.head()

   user_id  item_id  rating  timestamp
0        0       50       5  881250949
1        0      172       5  881250949
2        0      133       1  881250949
3      196      242       3  881250949
4      186      302       3  891717742

In [4]:
movie_titles = pd.read_csv('https://media.geeksforgeeks.org/wp-content/uploads/Movie_Id_Titles.csv')
movie_titles.head()

   item_id              title
0        1   Toy Story (1995)
1        2   GoldenEye (1995)
2        3  Four Rooms (1995)
3        4  Get Shorty (1995)
4        5     Copycat (1995)